PGM
DCLF FILE(*LIBL/File) RCDFMT(File) OPNID(*NONE) +
ALWVARLEN(*NO) ALWNULL(*NO) ALWGRAPHIC(*NO) DCLBINFLD(*DEC)
MONMSG MSGID(Message ID) CMPDTA(Comparison Data) EXEC(Command to Execute)

ENDPGM